fonte: https://minerandodados.com.br/trabalhando-com-banco-de-dados-sql-usando-python/

In [1]:
import pandas as pd
import sqlalchemy

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\ebraim.carvalho\anaconda3\lib\site-packages (1.0.2)

In [3]:
engine = sqlalchemy.create_engine('mysql+pymysql://gama:gama@127.0.0.1:3306/dw_mario_kart')

In [4]:
df = pd.read_sql_table('fato_resultado',engine)

In [5]:
df.head()

,ID_RESULTADO,ID_CORRIDA,ID_PILOTO,ID_CONSTRUTOR,POS_LARGADA,POS_FINAL,PONTOS_CORRIDA,RANK_VOLTA_RAPIDA,PONTO_VOLTA_RAPIDA,STATUS
0,1,18,1,1,1,1,10,2,0,Finished
1,2,18,2,2,5,2,8,3,0,Finished
2,3,18,3,3,7,3,6,5,0,Finished
3,4,18,4,4,11,4,5,7,0,Finished
4,5,18,5,1,3,5,4,1,1,Finished

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25040 entries, 0 to 25039
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID_RESULTADO        25040 non-null  int64
 1   ID_CORRIDA          25040 non-null  int64
 2   ID_PILOTO           25040 non-null  int64
 3   ID_CONSTRUTOR       25040 non-null  int64
 4   POS_LARGADA         25040 non-null  int64
 5   POS_FINAL           25040 non-null  int64
 6   PONTOS_CORRIDA      25040 non-null  int64
 7   RANK_VOLTA_RAPIDA   25040 non-null  int64
 8   PONTO_VOLTA_RAPIDA  25040 non-null  int64
 9   STATUS              25040 non-null  object
dtypes: int64(9), object(1)
memory usage: 1.9+ MB

In [14]:
df2 = pd.read_sql_query("select * from construtores where nome_construtor = 'McLaren'",engine)
df2.head()

   id_construtor nome_construtor nacionalidade_construtor
0              1         McLaren                  British

In [ ]:
query = '''
SELECT  emp.first_name,
        emp.last_name,
        emp.gender,
        depar.dept_name as departament_name,
        dept.from_date,
        dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
INNER JOIN departments depar
ON dept.dept_no = depar.dept_no;
'''

df = pd.read_sql_query(query,engine)
df.head()

In [17]:
# Criando um DataFrame a partir de uma query utilizando parâmetros dinâmicos.

query = 'SELECT *' \
      'FROM construtores ' \
      'WHERE nome_construtor = %s'
df3 = pd.read_sql_query(query, engine,params=[input('digite um construtor')])
df3.head()

digite um construtorMcLaren

   id_construtor nome_construtor nacionalidade_construtor
0              1         McLaren                  British

In [18]:
df4 = pd.read_sql_query("select * from TB_PAIS",engine)
df4.head()

   ID_PAIS    NOME_PAIS
0        1  Afghanistan
1        2      Albania
2        3      Algeria
3        4      Andorra
4        5       Angola